<?php

use yii\db\Migration;

/**
 * Class m191212_185232_add_posts
 */
class m191212_185232_add_posts extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->insert('airbagua_posts', [
            'title' => 'Восстановление подушек безопасности. За и против',
            'shortDescription' => 'Восстановление подушек безопасности 
            довольно сложная процедура, которая требует времени и наличия 
            соответствующих знаний. В данной ситуации салон автомобиля может 
            быть полностью испорчен и совершенно не соответствовать первоначальному варианту.',
            'content' => 'Восстановление подушек безопасности довольно сложная процедура, которая требует времени и наличия соответствующих знаний. В данной ситуации салон автомобиля может быть полностью испорчен и совершенно не соответствовать первоначальному варианту. Дело в том, что во время столкновения специальные датчики внутри салона подают сигнал на подушки, после чего они срабатывают. Как правило, подушки безопасности устанавливают в разных местах. Они в любом случае есть в руле, а также в торпеде на месте пассажира.

В большинстве моделей есть дополнительные подушки возле приборной панели и несколько боковых. Благодаря этому компенсируется сила во время удара, что может спасти человеку жизнь. А теперь представьте, во что превратиться салон после того, как из разных его частей начнут вылазить подушки безопасности?

Работы по восстановлению салона
Естественно, поверхность торпеды, внутренние части дверей и приборная панель уже не будет похожи на себя после сильного удара. Помимо этого, автомобиль включит горящую лампочку, которая оповещает водителя о неисправности. Данный сигнал никуда не денется пока мастера его не отключат. На восстановление подушек безопасности цена зависит зачастую от модели автомобиля и сложности замены. В основном процесс протекает по одной и той же заданной схеме, но бывают и трудности. Учитывая это наши, специалисты заранее обсуждают все нюансы с заказчиком и только потом приступают к работе. Полный комплекс восстановления состоит из следующих этапов:

Устранение горящей лампочки на приборной панели;
Косметический ремонт салона;
Замена подушек безопасности;
Ремонт управляющего блока (устранение горящей лампочки на приборной панели).
На каждом этапе происходит консультация с владельцем автомобиля, потому что ему виднее, что он хочет получить в итоге. Внешний вид салона можно как вернуть к первоначальному, так и частично изменить если водителя интересует такой вариант. Восстановление подушки безопасности осуществляется на родную модель. Таким образом, после проведения ремонта автомобиль становится как новый и при повторной аварии система безопасности прекрасно сработает, что, возможно, снова спасет вам жизнь. Заказывать восстановление однозначно стоит, потому что по сути специалисты обновляют средства защиты и возвращают ее к прежнему состоянию. Естественно, лучше ездить аккуратно и не попадать в аварии, но никогда не знаешь, что может случиться на дороге.

Качественное восстановление
Благодаря опытным мастерам нашей компании удается легко решать поставленные задачи. 
Много лет работы в данной сфере деятельности позволяет быстро находить проблемы и 
оперативно их устранять. При этом в арсенале нашей компании более 120 материалов для косметического 
ремонта салона. Мы сможем вернуть вашему автомобилю прежний вид или даже сделать что-то более оригинальное. 
Сами подушки также заменяются на оригинальную продукцию прекрасного качества. Если вас интересует восстановление
 системы безопасности в своем автомобиле, то обращайтесь прямо сейчас и 
 точно не пожалеете.'
        ]);
        $this->insert('airbagua_posts' ,[
            'title' => 'Ремонт после срабатывания подушки безопасности',
            'shortDescription' => 'Сегодня почти все автомобили оснащаются подушками безопасности. Нет этой опции только у самых дешевых машин.',
            'content' => 'Сегодня почти все автомобили оснащаются подушками безопасности. Нет этой опции только у самых дешевых машин. Некоторые авто имеют подушку только для водителя, многие – для водителя и пассажира, а есть системы безопасности, включающие в себя по пять-шесть деталей. Несомненно, это приспособление каждый день спасает множество жизней. Но бывают и неприятные конфузы, когда срабатывание подушки происходит случайно.

Например, когда случается небольшое, но точное лобовое столкновение. В срабатывании системы безопасности, казалось бы, нет никакой нужды, но подушка выстрелила из руля или торпеды.

Ремонт подушки безопасности – дело хлопотное. Он влечет за собой серьезные затраты.Для каждой модели авто это может быть разная сумма. Уточнить ее лучше в автосервисе. Но в любом случае цифра не может порадовать владельца авто. Некоторые автомобилисты пытаются найти выход из положения, пытаясь самостоятельно восстановить систему. У некоторых это получается. Но стоит ли браться за эту работу в погоне за экономией? Этот вопрос интересует многих владельцев авто. Ниже постараемся рассмотреть его более подробно.

СТОИТ ЛИ ВОССТАНАВЛИВАТЬ ПОДУШКУ САМОСТОЯТЕЛЬНО
 
Система безопасности состоит из таких составляющих:

датчик удара;
насос;
подушка;
блок управления.
Работает все это следующим образом:

При столкновении срабатывает датчик движения.
Сигнал передается на блок диагностики, известный как SRS.
Далее он поступает на устройство, наполненное сжатым воздухом.
В результате возникает сопротивление подушки безопасности при ударе.
Во всем ремонте есть два основных момента. Это настройка системного блока и ремонт пластиковой обшивки руля или торпеды. Если пластик еще можно купить и поменять самостоятельно, то с программированием блока может быть проблема. Далеко не для всех моделей настройки компьютера можно сбросить без применения специального оборудования. А оно есть только в специализированных техцентрах.

Потому замена системы и починка руля во многих случаях является полностью бесполезной. При последующем столкновении датчик хоть и сработает, но системный блок на это никак не отреагирует.

Потому, прежде чем браться за восстановление системы безопасности после ДТП, нужно узнать обо всех нюансах работы всей системы. Но в большинстве случаев придется покупать блок управления. Главное потом правильно его установить.

Важно!При покупке всех компонентов системы безопасности, экономия на работе специалистов из специализированного центра будет незначительной. Зато квалифицированное восстановление исключит дальнейшие сбои во всей системе.
 

САМОСТОЯТЕЛЬНОЕ ВОССТАНОВЛЕНИЕ
Если модификация авто допускает самостоятельное восстановление системы, и на это не жалко личного времени, можно проделать всю работу и своими руками. При этом следует учитывать, что замена подушек безопасности – не единственное, что нужно будет сделать. Потребуется еще и починка рулевого колеса или торпеды, а иногда и того, и другого.

Итак, необходимо купить следующее:

подушку в руль или руль целиком. При этом следует учитывать, встроен ли в рулевое колесо круиз-контроль;
подушку для пассажирского сидения;
крышку подушки пассажира, ее можно зашить, но для этого понадобятся дополнительные материалы – фактурная краска и суперклей. Проще купить новую;
блок управления, его еще называют блок аэрбэга;
датчики удара;
при необходимости привод аэрбэга, иногда он при столкновении прогорает, иногда нет.
Важно!Покупать нужно не китайские детали, а оригинальные. В противном случае устройство может не подходить не только по модификации, а еще и по размеру. Естественно, функционировать нормально оно не будет.
Блок должен соответствовать числу подушек независимо от того, какое число из них выстрелило. То есть, если система имеет две подушки, то блок должен быть на две даже в том случае, если выстрелила только одна. Казалось бы, это элементарно, но некоторые владельцы авто допускают эту ошибку. Кроме того, он должен быть либо новым, либо снятым с машины, система которой еще не срабатывала. Самостоятельно перешивать блок не нужно пытаться, это могут сделать только профессионалы в специализированных центрах. Потому проще купить новый.

 

ЗАМЕНА БЛОКА И ПАССАЖИРСКОЙ ПОДУШКИ
Затем следует заменить системный блок. Он расположен под панелью возле кулисы КПП. Крепится прибор на болтах, потому следует просто снять старый и установить новый. Затем следует приступить к процедуре замены подушки. Бардачок предварительно откручивается. Нижнюю и переднюю панели тоже придется снять.

В зависимости от марки производителя авто и степени повреждения торпеды, ее, возможно, придется полностью менять. Подушка, в любом случае, меняется вместе с крышкой. Они присоединены друг к другу намертво.

ЗАМЕНА ВОДИТЕЛЬСКОЙ ПОДУШКИ
Если будет меняться полностью весь руль, в этом не будет ничего сложного. Нужно просто правильно установить рулевое колесо. Если есть желание сэкономить, наверняка автолюбителя заинтересует вопрос: как снять подушку безопасности с руля? Для этого нужно с задней стороны руля найти два отверстия. В одно из них просовывается длинная отвертка и надавливается на пружину, находящуюся в отверстии. Один штырь, при помощи которого крепится подушка, при этом отодвинется. Со вторым отверстием проделывается то же самое. Использованная деталь после этого выпадет из руля, и устанавливается новая подушка.


Для увеличения безопасности пружину предрулевого переключателя тоже нужно будет заменить. Даже если визуально она не имеет повреждений, впоследствии деталь может пропускать ток.

В качестве вывода можно сказать, что замена подушек безопасности для каждого автомобиля может выглядеть по-разному. И, прежде чем приступать к работе, следует максимально подробно выяснить все нюансы восстановления системы после 
ДТП.'
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()

    {

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m191212_185232_add_posts cannot be reverted.\n";

        return false;
    }
    */
}
